{
  "Fear": [
    {
      "verse": "Isaiah 41:10",
      "text": "Do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you, I will help you, I will uphold you with my righteous right hand.",
      "explanation": "God is telling you not to be afraid or discouraged, because He is right there with you. He’s your protector and your source of strength. No matter what you’re going through, He promises to give you the support and help you need, holding you up with His powerful and faithful hand."
    },
    {
      "verse": "Psalm 23:4",
      "text": "Even though I walk through the valley of the shadow of death, I will fear no evil, for you are with me; your rod and your staff, they comfort me.",
      "explanation": "Even when you go through the hardest, scariest times in life—times that feel dark and dangerous—you won’t be afraid, because you know God is right there with you. His guidance and protection give you peace and reassurance."
    },
    {
      "verse": "2 Timothy 1:7",
      "text": "For God did not give us a spirit of fear, but of power and love and of a sound mind.",
      "explanation": "God does not give us a spirit of fear or timidity. Instead, He gives us strength, love, and self-discipline so we can face challenges with courage, compassion, and a clear mind."
    },
    {
      "verse": "Psalm 27:1",
      "text": "The Lord is my light and my salvation; whom shall I fear? The Lord is the stronghold of my life; of whom shall I be afraid?",
      "explanation": "Because the Lord gives guidance, protection, and strength, there is no reason to live in fear. With God as our defender and source of security, we can face anything with confidence."
    },
    {
      "verse": "1 John 4:18",
      "text": "There is no fear in love, but love casts out fear; because fear involves punishment, and the one who fears has not been perfected in love.",
      "explanation": "True, mature love—especially God's perfect love—drives out fear, particularly the fear of judgment. When we fully understand and live in God’s love, we no longer live in fear because we know we are secure in Him."
    },
    {
      "verse": "Psalm 56:3",
      "text": "When I am afraid, I will trust in you.",
      "explanation": "When fear arises, the response is to place trust in God. This verse is a simple but powerful reminder that faith in God is the answer to fear."
    },
    {
      "verse": "Joshua 1:9",
      "text": "Have I not coangmmanded you? Be strong and courageous; do not be frightened, and do not be dismayed, for the Lord your God is with you wherever you go.",
      "explanation": "God tells us to be brave and not let fear or worry take over, because He is always by our side to help and guide us. With Him, we don’t have to face tough situations alone."
    },
    {
      "verse": "Deuteronomy 3:22",
      "text": "You must not fear them, for the Lord your God Himself fights for you.",
      "explanation": "God tells His people not to be afraid of their enemies because He is the one who will fight and protect them. They can trust that God is on their side, so there’s no need to fear."
    },
    {
      "verse": "Hebrews 13:6",
      "text": "So we say with confidence, “The Lord is my helper; I will not be afraid. What can mere mortals do to me?",
      "explanation": "Because God helps and supports us, we don’t need to be afraid of what others might do. With God on our side, there’s no reason to live in fear."
    },
    {
      "verse": "Psalm 46:1-3",
      "text": "God is our refuge and strength, an ever-present help in trouble. Therefore we will not fear, though the earth give way and the mountains fall into the heart of the sea, though its waters roar and foam and the mountains quake with their surging.",
      "explanation": "God is a safe place and a strong helper when we face difficulties. Even if everything around us seems to fall apart or be chaotic, we don’t have to be afraid because God is with us and will protect us."
    },
    {
      "verse": "Lamentations 3:57",
      "text": "You came near when I called you, and you said: Do not fear.",
      "explanation": "When I called out to God in my trouble, He responded and comforted me, telling me not to be afraid. God is close and ready to help whenever we reach out to Him."
    },
    {
      "verse": "John 14:27",
      "text": "Peace I leave with you; my peace I give you. I do not give to you as the world gives. Do not let your hearts be troubled and do not be afraid.",
      "explanation": "Jesus offers us a special kind of peace—calm and lasting—that’s different from what the world offers. Because of this, we don’t need to be worried or afraid in our hearts."
    },
    {
      "verse": "Luke 12:32",
      "text": "Jesus says: Do not be afraid, little flock, for your Father has been pleased to give you the kingdom.",
      "explanation": "Jesus tells His followers not to be afraid because God, their loving Father, is happy to give them His kingdom. They are cared for and valued, so there’s no need for fear."
    },
    {
      "verse": "Haggai 2:5",
      "text": "This is what I covenanted with you when you came out of Egypt. And my Spirit remains among you. Do not fear.",
      "explanation": "God reminds His people that just as He promised when He brought them out of Egypt, His Spirit is still with them. Because of His ongoing presence, they don’t need to be afraid."
    },
    {
      "verse": "Isaiah 41:13",
      "text": "For I am the Lord your God who takes hold of your right hand and says to you, Do not fear; I will help you.",
      "explanation": "God promises to hold and guide you personally. Because He is your helper, you don’t need to be afraid. He is always there to support you."
    }
  ],
  "Joy": [
    {
      "verse": "Philippians 4:4",
      "text": "Rejoice in the Lord always. I will say it again: Rejoice!",
      "explanation": "Be joyful in your relationship with God all the time—no matter what’s happening. In fact, it's so important, Paul says it twice: keep choosing joy."
    },
    {
      "verse": "Psalm 16:11",
      "text": "You make known to me the path of life; you will fill me with joy in your presence, with eternal pleasures at your right hand.",
      "explanation": "God shows you the way to truly live, and being close to Him brings deep, lasting joy. With Him, there’s fullness of life now and forever."
    },
    {
      "verse": "Nehemiah 8:10",
      "text": "The joy of the Lord is your strength.",
      "explanation": "Celebrate with joy, share with others, and draw strength from God's goodness, not from sorrow."
    },
    {
      "verse": "James 1:2",
      "text": "Consider it a joy, brothers and sisters, whenever you face trials of many kinds.",
      "explanation": "Find joy in facing challenges, because they help grow your faith and build perseverance."
    },
    {
      "verse": "Thessalonians 5:16-18",
      "text": "Rejoice always, pray continually, give thanks in all circumstances; for this is God’s will for you in Christ Jesus.",
      "explanation": "Live with constant joy, stay connected to God through prayer, and be thankful in every situation—this is how God wants you to live."
    },
    {
      "verse": "John 16:24",
      "text": "Until now you have asked nothing in my name. Ask, and you will receive, that your joy may be full.",
      "explanation": "Pray with confidence, trusting that God hears you, and this will bring you complete joy."
    },
    {
      "verse": "Psalm 32:11",
      "text": "So rejoice in the Lord and be glad, all you who obey him! Shout for joy, all you whose hearts are pure!",
      "explanation": "Be happy and celebrate because God forgives and protects those who trust Him."
    },
    {
      "verse": "Proverbs 17:22",
      "text": "A cheerful heart is good medicine, but a crushed spirit dries up the bones.",
      "explanation": "A cheerful heart brings good health, but being sad and worried can harm your body."
    },
    {
      "verse": "Romans 15:13",
      "text": "May the God of hope fill you with all joy and peace in believing, so that by the power of the Holy Spirit you may abound in hope.",
      "explanation": "This verse is a prayer that God will fill you with hope and joy as you put your trust in Him. It reminds you that trusting God brings a deep sense of peace, even in difficult times. The Holy Spirit works in your heart to give you strength, comfort, and confidence, helping you to stay hopeful and joyful no matter what challenges you face."
    },
    {
      "verse": "Romans 12:12",
      "text": "Rejoice in hope, be patient in tribulation, be constant in prayer.",
      "explanation": "Stay joyful because you have hope in God's promises, even when things are tough. When you face difficulties, be patient and keep trusting God’s timing. Always keep praying and talking to God, no matter what is happening in your life. This helps you stay connected to Him and gives you strength to keep going."
    },
    {
      "verse": "Ecclesiastes 9:7",
      "text": "Go, eat your bread with joy, and drink your wine with a merry heart; for God has already approved what you do.",
      "explanation": "Enjoy your life and the good things God gives you—eat, drink, and be happy with your loved ones—because these simple joys are gifts from God during your time on earth."
    },
    {
      "verse": "Psalm 118:24",
      "text": "This is the day that the Lord has made; let us rejoice and be glad in it.",
      "explanation": "Today is a special gift from God, so be glad and rejoice, making the most of every moment with joy and gratitude."
    },
    {
      "verse": "John 15:11",
      "text": "I have told you these things so that my joy may be in you and that your joy may be complete.",
      "explanation": "Jesus is telling us that His desire is for us to experience deep and lasting joy. This joy comes from staying connected to Him, living in His love, and following the way He teaches us to live. When we obey His words and remain close to Him, our hearts are filled with true happiness that doesn’t depend on our circumstances. This joy is complete because it is rooted in God’s love and promises, giving us peace and fulfillment even during hard times."
    },
    {
      "verse": "Galatians 5:22-23",
      "text": "But the fruit of the Spirit is love, joy, peace, forbearance, kindness, goodness, faithfulness, gentleness and self-control. Against such things there is no law.",
      "explanation": "When you follow Jesus and let the Holy Spirit guide you, you develop qualities like love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control, which help you live a good and meaningful life."
    },
    {
      "verse": "Psalm 30:5",
      "text": "Weeping may stay for the night, but rejoicing comes in the morning.",
      "explanation": "Even in difficult times, joy will come again. God brings new hope and happiness after hardship, reminding us that sorrow is temporary but His joy is lasting."
    }
  ],
  "Sadness": [
    {
      "verse": "Psalm 34:18",
      "text": "The Lord is close to the brokenhearted and saves those who are crushed in spirit.",
      "explanation": "God stays near to those who are hurting deeply, and He rescues people who feel completely overwhelmed or broken inside."
    },
    {
      "verse": "Matthew 11:28",
      "text": "Come to me, all you who are weary and burdened, and I will give you rest.",
      "explanation": "Jesus is inviting you to bring your sadness, stress, or heavy heart to Him. He promises to give you peace and rest—not just physical, but deep, inner rest for your soul."
    },
    {
      "verse": "Psalm 147:3",
      "text": "He heals the brokenhearted and binds up their wounds.",
      "explanation": "God is a healer of deep emotional pain and sorrow. When your heart feels shattered, and you carry wounds from loss or disappointment, God gently binds and heals those wounds. This process might not be instant, but His healing power restores hope, peace, and wholeness over time. It’s a tender reminder that God cares about our inner pain and works to make us whole again."
    },
    {
      "verse": "Psalm 42:11",
      "text": "Why, my soul, are you downcast? Why so disturbed within me? Put your hope in God, for I will yet praise him, my Savior and my God.",
      "explanation": "When sadness weighs heavily on the soul, this verse encourages us to pause and reflect on why we feel so downcast. It then offers a powerful solution—putting our hope in God. By shifting our focus from despair to trust in God’s goodness, we open ourselves to praise and joy once again. This verse is an invitation to choose hope even in sadness."
    },
    {
      "verse": "Revelation 21:4",
      "text": "He will wipe every tear from their eyes. There will be no more death or mourning or crying or pain, for the old order of things has passed away.",
      "explanation": "This verse looks forward to the future promise God has for us—a time when all sadness, pain, and death will be completely removed. It assures us that God will personally comfort us by wiping away every tear. This hope can help us endure current sadness, knowing that God’s ultimate plan includes perfect peace and joy without any more suffering."
    },
    {
      "verse": "Hebrews 4:15-16",
      "text": "For we do not have a high priest who is unable to empathize with our weaknesses, but we have one who has been tempted in every way, just as we are—yet he did not sin. Let us then approach God’s throne of grace with confidence, so that we may receive mercy and find grace to help us in our time of need.",
      "explanation": "Jesus understands human sadness and weakness because He experienced pain and temptation too. Because of this, we can confidently come to God, knowing He will show us mercy and grace. In our moments of sadness, we don’t have to feel alone or ashamed; instead, we can seek God’s help freely and receive the strength we need to endure and heal."
    },
    {
      "verse": "2 Corinthians 1:3-4",
      "text": "Praise be to the God and Father of our Lord Jesus Christ, the Father of compassion and the God of all comfort, who comforts us in all our troubles, so that we can comfort those in any trouble with the comfort we ourselves receive from God.",
      "explanation": "God is compassionate and comforting. He helps us in our times of trouble so that we can, in turn, comfort others who are facing difficulties, using the same comfort we received from Him."
    },
    {
      "verse": "Matthew 5:4",
      "text": "Blessed are those who mourn, for they will be comforted.",
      "explanation": "Jesus promises that those who grieve will find comfort—not necessarily through instant relief, but through His presence and eventual healing."
    },
    {
      "verse": "John 16:33",
      "text": "In this world you will have trouble. But take heart! I have overcome the world.",
      "explanation": "Jesus acknowledges that sorrow is part of life but reminds us that He has already secured the victory, giving us peace amid sadness."
    },
    {
      "verse": "Romans 8:18",
      "text": "For I consider that the sufferings of this present time are not worthy to be compared with the glory that will be revealed in us.",
      "explanation": "Paul reminds us that our current sadness and suffering are temporary and nothing compared to the eternal joy that awaits those who hope in Christ."
    },
    {
      "verse": "Jeremiah 29:11",
      "text": "For I know the plans I have for you,” declares the Lord, “plans to prosper you and not to harm you, plans to give you hope and a future.",
      "explanation": "When sadness makes the future look bleak or uncertain, God assures us that He has good plans for our lives. These plans are filled with hope, prosperity, and well-being—not harm or despair. This verse offers reassurance that no matter how dark today feels, God’s intentions are loving and hopeful, and He is guiding us towards a better tomorrow."
    },
    {
      "verse": "Psalm 9:9",
      "text": "The Lord is a shelter for the oppressed, a refuge in times of trouble.",
      "explanation": "Psalm 9:9 is a promise of God’s character: He is not only aware of suffering, He is actively present in it. He doesn’t abandon the weak—He defends them. He doesn’t ignore pain—He becomes a fortress in the middle of it. Whether you're feeling oppressed by the world or trapped by your own inner turmoil, this verse encourages you to turn to God as your place of safety, strength, and peace."
    },
    {
      "verse": "Psalm 3:3",
      "text": "But you, Lord, are a shield around me, my glory, the One who lifts my head high.",
      "explanation": "Psalm 3:3 is a powerful reminder that even in our lowest moments, God is our protector, our source of dignity, and the one who restores our strength. When sadness weighs us down, He surrounds us like a shield, reminds us of our worth, and gently lifts our heads with hope and encouragement."
    },
    {
      "verse": "2 Corinthians 1:3–4",
      "text": "Praise be to the God and Father of our Lord Jesus Christ, the Father of compassion and the God of all comfort, who comforts us in all our troubles so that we can comfort those in any trouble with the comfort we receive from God.",
      "explanation": "God is praised as the Father of compassion and the source of all comfort. He comforts us in every trouble we face so that we can also comfort others who are experiencing difficulties, sharing with them the same kindness and support that God has given to us."
    },
    {
      "verse": "Isaiah 41:10",
      "text": "So do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you and help you; I will uphold you with my righteous right hand.",
      "explanation": "Isaiah 41:10 brings comfort specifically to those feeling sadness or despair by reminding us that God is near even in our darkest moments. When we feel overwhelmed by sorrow or fear, this verse encourages us not to lose hope because God promises to strengthen and support us. It shows that God lovingly holds us up when we feel weak or brokenhearted, assuring us that we are never abandoned and that His presence can bring peace and courage to overcome sadness."
    }
  ],
  "Anger": [
    {
      "verse": "Ephesians 4:26",
      "text": "In your anger do not sin”: Do not let the sun go down while you are still angry.",
      "explanation": "It’s okay to feel angry sometimes—but don’t let that anger lead you to do something wrong. And don’t hold onto it for too long; deal with it before the day ends."
    },
    {
      "verse": "James 1:19-20",
      "text": "My dear brothers and sisters, take note of this: Everyone should be quick to listen, slow to speak and slow to become angry, because human anger does not produce the righteousness that God desires.",
      "explanation": "Be willing to really listen, don’t rush to speak your mind, and don’t get angry easily—because when we let anger take over, we’re not living the way God wants us to."
    },
    {
      "verse": "Proverbs 15:1",
      "text": "A gentle answer turns away wrath, but a harsh word stirs up anger.",
      "explanation": "If someone is angry, responding with calm and kind words can help stop the anger. But if you reply with harsh or rude words, it will only make things worse and lead to more conflict."
    },
    {
      "verse": "Psalms 37:8",
      "text": "Refrain from anger and turn from wrath; do not fret—it leads only to evil.",
      "explanation": "Let go of anger and don't let it control you. Getting angry or upset can lead to bad decisions and hurtful actions."
    },
    {
      "verse": "Proverbs 14:17",
      "text": "A quick-tempered person does foolish things, and the one who devises evil schemes is hated.",
      "explanation": "People who get angry quickly often do things they regret. And those who plan to do wrong are disliked by others."
    },
    {
      "verse": "Proverbs 14:29",
      "text": "Whoever is patient has great understanding, but one who is quick-tempered displays folly.",
      "explanation": "Being patient shows wisdom and self-control. But getting angry too fast shows a lack of good judgment."
    },
    {
      "verse": "Galatians 5:19-21",
      "text": "The acts of the flesh are obvious: sexual immorality, impurity and debauchery; idolatry and witchcraft; hatred, discord, jealousy, fits of rage, selfish ambition, dissensions, factions and envy; drunkenness, orgies, and the like. I warn you, as I did before, that those who live like this will not inherit the kingdom of God.",
      "explanation": "Living by selfish desires leads to sinful actions—and those who live this way will not receive God’s kingdom."
    },
    {
      "verse": "Matthew 5:21-22",
      "text": "You have heard that it was said to the people long ago: You shall not murder, and anyone who murders will be subject to judgment. But I tell you that anyone who is angry with a brother or sister will be subject to judgment. Again, anyone who says to a brother or sister: Raca, is answerable to the court. And anyone who says: You fool! will be in danger of the fire of hell.",
      "explanation": "Jesus teaches that it's not just murder that's wrong—but also anger, insults, and broken relationships. He wants us to fix our issues with others before coming to God. Settle conflicts quickly before they grow into bigger problems."
    },
    {
      "verse": "Ephesians 4:31-32",
      "text": "Get rid of all bitterness, rage and anger, brawling and slander, along with every form of malice. Be kind and compassionate to one another, forgiving each other, just as in Christ God forgave you.",
      "explanation": "Let go of all anger, hatred, and harmful talk. Instead, be kind, caring, and forgiving—just like God forgave you through Jesus."
    },
    {
      "verse": "John 13:35",
      "text": "By this everyone will know that you are my disciples, if you love one another.",
      "explanation": "Jesus is saying that the way people will recognize His true followers is by how they treat each other—with love. It’s not about how much you know, how often you go to church, or what you say—it’s about how you care for others. When Christians genuinely love, support, and serve one another, they show the world what Jesus is like. Love is the mark of a true disciple."
    },
    {
      "verse": "Proverbs 19:11",
      "text": "Good sense makes one slow to anger, and it is his glory to overlook an offense.",
      "explanation": "Wise people are patient—they don’t get angry quickly. Instead of holding grudges or reacting right away when someone offends them, they choose to let it go. Overlooking an insult or offense shows strength, maturity, and honor. It means that not everything deserves a reaction, and sometimes the best response is to stay calm and forgive."
    },
    {
      "verse": "Ecclesiastes 7:9",
      "text": "Be not quick in your spirit to become angry, for anger lodges in the heart of fools.",
      "explanation": "This verse warns us not to get angry too fast or easily. Getting upset quickly shows a lack of wisdom. People who lose their temper often are acting foolishly because anger can lead to bad decisions and problems. It’s better to be calm and patient rather than let anger control you."
    },
    {
      "verse": "Proverbs 29:22",
      "text": "A man of wrath stirs up strife, and one given to anger causes much transgression.",
      "explanation": "People who get angry easily often cause fights and problems around them. When someone has a quick temper, they’re more likely to do wrong things because anger makes them act without thinking."
    },
    {
      "verse": "Proverbs 15:18",
      "text": "A hot-tempered person stirs up conflict, but the one who is patient calms a quarrel.",
      "explanation": "If someone gets angry quickly, they often cause fights and arguments. But a person who stays calm and patient can help stop conflicts and bring peace."
    },
    {
      "verse": "Psalm 37:8",
      "text": "Stop being angry! Turn from your rage! Do not lose your temper -- it only leads to harm.",
      "explanation": "This verse tells us to stop being angry and to calm down instead of staying upset. Holding onto anger and worry only leads to bad choices and harm."
    }
  ],
  "Anxiety": [
    {
      "verse": "Philippians 4:6-7",
      "text": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus.",
      "explanation": "Don’t let worry take over. Instead, talk to God about everything—bring your concerns to Him with a thankful heart. When you do that, God will give you a deep peace that doesn’t always make sense but will protect your heart and mind through Jesus."
    },
    {
      "verse": "1 Peter 5:7",
      "text": "Cast all your anxiety on him because he cares for you.",
      "explanation": "Give all your worries and fears to God—completely let go of them—because He genuinely cares about you and what you’re going through."
    },
    {
      "verse": "Luke 12:22",
      "text": "And He said to His disciples: Therefore I tell you, do not be anxious about your life, what you will eat, nor about your body, what you will put on.",
      "explanation": "Jesus is telling His followers not to be anxious or stressed about everyday needs like food and clothes. He wants them to trust that God will take care of those things."
    },
    {
      "verse": "Proverbs 12:25",
      "text": "Anxiety in a man’s heart weighs him down, but a good word makes him glad.",
      "explanation": "Worry and anxiety can make you feel heavy and sad inside. But hearing kind and encouraging words can lift your spirits and make you feel better."
    },
    {
      "verse": "Psalm 34:4",
      "text": "I sought the LORD, and He answered me and delivered me from all my fears.",
      "explanation": "When the writer was afraid, he prayed and asked God for help. God listened and helped him overcome his fears."
    },
    {
      "verse": "Matthew 6:34",
      "text": "Therefore do not worry about tomorrow, for tomorrow will worry about its own things. Sufficient for the day is its own trouble.",
      "explanation": "Jesus is telling us not to worry about what will happen in the future. Instead, focus on today and handle its challenges. Worrying about tomorrow only adds more stress."
    },
    {
      "verse": "Proverbs 3:5",
      "text": "Trust in the Lord with all your heart, And lean not on your own understanding.",
      "explanation": "This verse encourages you to fully trust God with everything in your life instead of relying only on what you think or understand. God knows what’s best, even when you don’t."
    },
    {
      "verse": "Psalm 46:10",
      "text": "Be still, and know that I am God; I will be exalted among the nations, I will be exalted in the earth!",
      "explanation": "This verse reminds us to stop rushing, be calm, and trust that God is in control. God is powerful and will be honored everywhere. When we pause and trust Him, we find peace."
    },
    {
      "verse": "Psalm 4:8",
      "text": "I will both lie down in peace, and sleep; For You alone, O Lord, make me dwell in safety.",
      "explanation": "This verse shows trust in God’s protection. Because God keeps us safe, we can rest peacefully and sleep without fear."
    },
    {
      "verse": "John 14:27",
      "text": "Peace I leave with you, My peace I give to you; not as the world gives do I give to you. Let not your heart be troubled, neither let it be afraid.",
      "explanation": "Jesus is promising to give His special peace to His followers—a peace that is different from what the world offers. Because of His peace, we don’t need to be worried or scared."
    },
    {
      "verse": "2 Timothy 1:7",
      "text": "For God has not given us a spirit of fear, but of power and of love and of a sound mind.",
      "explanation": "God doesn’t want us to live in fear or be afraid. Instead, He gives us strength and courage, the ability to love others deeply, and a clear, calm mind to make good choices."
    },
    {
      "verse": "Isaiah 41:10",
      "text": "Fear not, for I am with you; Be not dismayed, for I am your God. I will strengthen you, Yes, I will help you, I will uphold you with My righteous right hand.",
      "explanation": "God is telling you not to be afraid or worried because He is always with you. He promises to give you strength, help you when you need it, and support you through everything."
    },
    {
      "verse": "Joshua 1:9",
      "text": "Have I not commanded you? Be strong and of good courage; do not be afraid, nor be dismayed, for the Lord your God is with you wherever you go.",
      "explanation": "God is telling you to be brave and confident. You should not be scared or lose hope because God will always be by your side, no matter where you go."
    },
    {
      "verse": "Psalm 55:22",
      "text": "Cast your burden on the Lord, And He shall sustain you; He shall never permit the righteous to be moved.",
      "explanation": "This verse encourages you to give your worries and problems to God. He will take care of you and keep you strong, so you won’t be overwhelmed or fall apart."
    },
    {
      "verse": "Philippians 4:13",
      "text": "I can do all things through Christ who strengthens me.",
      "explanation": "When you feel anxious or overwhelmed, this verse reminds you that you don’t have to face those feelings alone. God gives you the strength and courage to get through tough moments, including anxiety. You can rely on Him to help you stay calm and strong."
    }
  ],
  "Gratitude": [
    {
      "verse": "1 Thessalonians 5:18",
      "text": "Give thanks in all circumstances; for this is God’s will for you in Christ Jesus.",
      "explanation": "Be thankful no matter what’s going on in your life. God wants you to have a heart of gratitude through everything because it helps you trust Him and stay connected to His plan."
    },
    {
      "verse": "Psalm 107:1",
      "text": "Give thanks to the Lord, for he is good; his love endures forever.",
      "explanation": "Thank God because He is always good, and His love never ends—it lasts forever."
    }
  ],
  "Peace": [
    {
      "verse": "John 14:27",
      "text": "“Peace I leave with you; my peace I give you. I do not give to you as the world gives. Do not let your hearts be troubled and do not be afraid.",
      "explanation": "Jesus is offering you His peace, a peace that’s different from what the world can give. It’s not based on circumstances. So, don’t let worry or fear take over—He’s giving you a deeper, lasting peace."
    },
    {
      "verse": "Isaiah 26:3",
      "text": "You will keep in perfect peace those whose minds are steadfast, because they trust in you.",
      "explanation": "God promises to give complete, unshakable peace to those who stay focused on Him and trust Him fully."
    }
  ]
}