{
  "Fear": [
    {
      "verse": "Isaiah 41:10",
      "text": "Do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you, I will help you, I will uphold you with my righteous right hand.",
      "explanation": "God is telling you not to be afraid or discouraged, because He is right there with you. He’s your protector and your source of strength. No matter what you’re going through, He promises to give you the support and help you need, holding you up with His powerful and faithful hand."
    },
    {
      "verse": "Psalm 23:4",
      "text": "Even though I walk through the valley of the shadow of death, I will fear no evil, for you are with me; your rod and your staff, they comfort me.",
      "explanation": "Even when you go through the hardest, scariest times in life—times that feel dark and dangerous—you won’t be afraid, because you know God is right there with you. His guidance and protection give you peace and reassurance."
    }
  ],
  "Joy": [
    {
      "verse": "Philippians 4:4",
      "text": "Rejoice in the Lord always. I will say it again: Rejoice!",
      "explanation": "Be joyful in your relationship with God all the time—no matter what’s happening. In fact, it's so important, Paul says it twice: keep choosing joy."
    },
    {
      "verse": "Psalm 16:11",
      "text": "You make known to me the path of life; you will fill me with joy in your presence, with eternal pleasures at your right hand.",
      "explanation": "God shows you the way to truly live, and being close to Him brings deep, lasting joy. With Him, there’s fullness of life now and forever."
    }
  ],
  "Sadness": [
    {
      "verse": "Psalm 34:18",
      "text": "The Lord is close to the brokenhearted and saves those who are crushed in spirit.",
      "explanation": "God stays near to those who are hurting deeply, and He rescues people who feel completely overwhelmed or broken inside."
    },
    {
      "verse": "Matthew 11:28",
      "text": "Come to me, all you who are weary and burdened, and I will give you rest.",
      "explanation": "Jesus is inviting you to bring your sadness, stress, or heavy heart to Him. He promises to give you peace and rest—not just physical, but deep, inner rest for your soul."
    }
  ],
  "Anger": [
    {
      "verse": "Ephesians 4:26",
      "text": "In your anger do not sin”: Do not let the sun go down while you are still angry.",
      "explanation": "It’s okay to feel angry sometimes—but don’t let that anger lead you to do something wrong. And don’t hold onto it for too long; deal with it before the day ends."
    },
    {
      "verse": "James 1:19-20",
      "text": "My dear brothers and sisters, take note of this: Everyone should be quick to listen, slow to speak and slow to become angry, because human anger does not produce the righteousness that God desires.",
      "explanation": "Be willing to really listen, don’t rush to speak your mind, and don’t get angry easily—because when we let anger take over, we’re not living the way God wants us to."
    }
  ],
  "Anxiety": [
    {
      "verse": "Philippians 4:6-7",
      "text": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus.",
      "explanation": "Don’t let worry take over. Instead, talk to God about everything—bring your concerns to Him with a thankful heart. When you do that, God will give you a deep peace that doesn’t always make sense but will protect your heart and mind through Jesus."
    },
    {
      "verse": "1 Peter 5:7",
      "text": "Cast all your anxiety on him because he cares for you.",
      "explanation": "Give all your worries and fears to God—completely let go of them—because He genuinely cares about you and what you’re going through."
    }
  ],
  "Gratitude": [
    {
      "verse": "1 Thessalonians 5:18",
      "text": "Give thanks in all circumstances; for this is God’s will for you in Christ Jesus.",
      "explanation": "Be thankful no matter what’s going on in your life. God wants you to have a heart of gratitude through everything because it helps you trust Him and stay connected to His plan."
    },
    {
      "verse": "Psalm 107:1",
      "text": "Give thanks to the Lord, for he is good; his love endures forever.",
      "explanation": "Thank God because He is always good, and His love never ends—it lasts forever."
    }
  ],
  "Peace": [
    {
      "verse": "John 14:27",
      "text": "“Peace I leave with you; my peace I give you. I do not give to you as the world gives. Do not let your hearts be troubled and do not be afraid.",
      "explanation": "Jesus is offering you His peace, a peace that’s different from what the world can give. It’s not based on circumstances. So, don’t let worry or fear take over—He’s giving you a deeper, lasting peace."
    },
    {
      "verse": "Isaiah 26:3",
      "text": "You will keep in perfect peace those whose minds are steadfast, because they trust in you.",
      "explanation": "God promises to give complete, unshakable peace to those who stay focused on Him and trust Him fully."
    }
  ]
}